rae/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 3.978e-7; // set equal to eddy viscosity assuming 
                                  // a Prt = 1.

boundaryField
{

    side1
    {
        type            empty;
    }

    side2
    {
        type            empty;
    }

    outFlow
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            compressible::alphatWallFunction;
	Prt		0.85;
        value           uniform 0;
    }

    inFlow
    {
        type            calculated;
        value           uniform 3.978e-7; // set equal to eddy viscosity assuming 
					  // a Prt = 1.
    }
}




// ************************************************************************* //
